{
  "intents": [
    {
      "tag": "greeting",
      "patterns": [
        "Hi",
        "Oi!",
        "Hey",
        "How are you",
        "Hello"
      ],
      "responses": [
        "Hey :)",
        "Hi there, what can I do for you?",
        "Hi there, how can I help?"
      ]
    },
    {
      "tag": "goodbye",
      "patterns": ["Bye", "See you later", "Goodbye"],
      "responses": [
        "See you later, thanks for visiting",
        "Have a nice day",
        "Bye! Come back again soon."
      ]
    },
    {
      "tag": "website",
      "patterns": ["website", "official website","webpage","official website of mlrit?","officialwebpage"],
      "responses": [
        "https://mlrit.ac.in/"
      ]
    },
    {
      "tag": "thanks",
      "patterns": ["Thanks", "Thank you", "That's helpful", "Thank's a lot!"],
      "responses": ["Happy to help!", "Any time!", "My pleasure"]
    },
    {
      "tag": "college",
      "patterns": [
        "Which college?",
        "What is college name?",
        "college name"
      ],
      "responses": [
        "MLR institute of technology"
      ]
    },
    {
      "tag": "academics",
      "patterns": [
        "academics offered",
        "admission availabe",
        "what can i study here?"
      ],
      "responses": [
        "1. B.tech\n\t2. M.tech\n\t3. M.B.A"
      ]
    },
    {
      "tag": "branch",
      "patterns": [
        "branches in college?",
        "How many branches are offered in mlrit?","braches",
        "what are the branches offered"

      ],
      "responses": [
        "MLRIT offers B.tech in CSE-AIML, CSE-C, CSE-DS, IT, Mechanical, ECE, CSIT , CSE."
      ]
    },
    {
      "tag": "fees",
      "patterns": [
        "What is total fees?",
        "Fees for AI",
        "Fees for CSE",
        "Fees for DS",
        "Any scholarship?","fee"
      ],
      "responses": [
        "1. B.Tech fees : 1,10,000\n\t2. M.Tech : 60,000\n\t3. M.B.A : 60,000 "
      ]
    },
    {
      "tag": "cources",
      "patterns": [
        "what cources are offered in mlrit?",
        "Which is the best cource offered?",
        "Recommend some cources?",
        "courses offered",
        "course offered"
      ],
      "responses": [
        "Btech in CSE-AIML, CSE, CSE-DS, IT, ECE, CSIT, MECHANICAL,CSE-C"
      ]
    },
    {
      "tag": "hod csm",
      "patterns": [
        "who is hod of csm?",
        "csm hod?","hod csm"
      ],
      "responses": [
        "Prof. Dr. kashi sai prasad\n\tB.tech(CSE),M.Tech(CSE), PhD(CSE)"
      ]
    },
    {
      "tag": "secretary",
      "patterns": [
        "secretary name",
        "who is the secretary of mlrit"
      ],
      "responses": [
        "Marri rajashekar reddy"
      ]
    },
    {
      "tag": "bot info",
      "patterns": [
        "who are you",
        "tell something about yourself"
      ],
      "responses": [
        "I was created as a mini project.\nI was developed by Nehanth, satya, srujana and anvesh\n\tunder the guidance of prof. soumya"
      ]
    },
    {
      "tag": "chairman",
      "patterns": [
        "chairman name",
        "who is the chairman of mlrit"
      ],
      "responses": [
        "Marri laxman reddy"
      ]
    },
    {
      "tag": "ranking",
      "patterns": [
        "what is the rank of mlrit?",
        "ranking of mlrit?",
        "ranking?"
      ],
      "responses": [
        "Currently MLRIT is ranked 130th PAN-India in Engineering Discipline as declared by NIRF Ranking 2021.\n\t1st Rank in India at ARIIA-2021 among private / Self Financed College / institutions."
      ]
    },
    {
      "tag": "info",
      "patterns": [
        "MLRIT info?",
        "info about mlrit",
        "establishment of mlrit"
      ],
      "responses": [
        "Established in 2005, Marri laxman reddy institute of technology [MLRIT] is a premier Autonomous institution in the state of telangana imparting a holistic technical education to the students residing  in India. \n\tThe institution has always been ranked amongst a well performing institution by National Institutional Ranking Framework (NIRF), NAAC, Government of India."
      ]
    },
    {
      "tag": "dean",
      "patterns": [
        "Who is the dean of training and placement?",
        "placement dean"
      ],
      "responses": [
        "Dr. Rajashekar"
      ]
    },
    {
      "tag": "csm faculty",
      "patterns": [
        "faculty for ai?",
        "faculty of csm",
        "who is the faculty for csm",
        "csm faculty"
      ],
      "responses": [
        "1.HOD and associate professor -: Dr.kashi sai prasad ,\n\t 2.Associative professors -: \n\t P.srinivas reddy ,\n\t Dr.k.varada raj kumar ,\n\t V Surya Pavan Kumar ,\n\t J VIJAY GOPAL ,\n\t Gunda Aishwarya, \n\tMr.R.AKHILESH REDDY ,\n\t3.Assistant professors -:\n\t R SIVA KUMAR, \n\t Talari Meena, \n\t NEMALA JAYASRI, \n\t P LOKESH KUMAR ,\n\t J. TEJA  ,\n\t Mrs. K. ANUSHA , \n\t Saima Afreen ,\n\t SHAIK GOUSE PASHA, \n\t P Sai Kumar , \n\t DAMALA OBULESU ,\n\t BHASKAR MEKALA , \n\t MASIGIRI NAGALAKSHMI ,\n\t Y.NAVEEN, \n\t Kallam Hemanthi , \n\t Vijay Keerthika ,\n\t G. Sowmya ,\n\t G. Umamaheswari ,\n\t B.Prabhanjan Yadav ,\n\t K. Jyothsna Reddy \n\t"
      ]
    },
    {
      "tag": "average package",
      "patterns": [
        "average package?",
        "What is the avg package?"
      ],
      "responses": [
        "average package is 6 Lakhs"
      ]
    },
    {
      "tag": "highest package",
      "patterns": [
        "highest package?",
        "What is highest package?"
      ],
      "responses": [
        "highest package is 54 Lakhs"
      ]
    },
    {
      "tag": "intake",
      "patterns": [
        "intake",
        "What is the intake"
      ],
      "responses": [
        "1. UG Intake is 420 \n\t2. PG intake is 120"
      ]
    },
    {
      "tag": "vision",
      "patterns": [
        "what is the vision of mlrit?",
        "mlrit vision?",
        "vision and mission?"
      ],
      "responses": [
        "To achieve excellent standards of quality education by keeping pace with rapidly changing technologies and to create technical manpower of global standards with capabilities of accepting new challenges."
      ]
    },
    {
      "tag": "funny",
      "patterns": [
        "Tell me a joke!",
        "Something funny!",
        "Do you know a joke?" 
      ],
      "responses": [
        
        "What did the buffalo say when his son left for college? Bison."
      ]
    },
    {
      "tag": "transport",
      "patterns": [
        "is college transport available?",
        "do you have any transport?",
        "how do students travel?",
        "how to reach college?",
        "transport" 
      ],
      "responses": [
        
        "college do provide multiple buses transporting students across the city and have yearly charges accordingly"
      ]
    },
    {
      "tag": "hostel",
      "patterns": [
        "do you provide hostel?",
        "is there hostel inside college?",
        "hostel availability",
        "hostel",
        "hostel facility" 
      ],
      "responses": [
        
        "college do have in campus hostel for students along with mess charging fees of rupees 1000000"
      ]
    },
    {
      "tag": "csm",
      "patterns": [
        "csm overview",
        "overview of csm?",
        "about csm"
      ],
      "responses": [
        
        "The B.Tech program in CSM was started in the year 2020 with an intake of 60, increased to 180 in 2021. The department is headed by Dr.P Madhuravani, with vast Industrial and Teaching experience of 15 years. The department currently has 56 faculty members, including 9 doctorates. Faculty research interest spans a wide range: from abstract theory to down-to-earth problems of immediate interest to industry. Current areas of research of the department has broadly classified into the following categories: Machine Learning, Deep Learning, Reinforcement Learning, Robotics, Natural Language Processing, Computer Vision.The department is actively involved in R & D as well as consultancy projects and has collaborations with several industries, academic institutes and R & D organizations in the country.The modern air conditioned laboratories of the department serve the teaching and research needs of the students and faculty. All systems are connected to the department LAN through fiber optic which is a part of the Institute LAN network. Internet connectivity is provided by a 300 Mbps link leased from Gateway and Vainavi. Additional facilities like Central Computing Facility, e-Class room with multimedia facilities, Internet, Centrally air-conditioned Seminar Hall/Auditorium are also available.The department has been striving hard to inculcate conceptual and technical skills in students through a scientific teaching methodology based on lectures, case studies, seminars, group discussions, project works, assignments, quiz programs etc. The systematic and well planned approach to problem solving is emphasized in the classrooms, laboratories through the course projects and additional computer training beyond the scope of the syllabus. Teaching aids such as LCD Projector, OHP, CD demo, equipment demonstrations, Models, Charts etc are regularly used to enhance better understanding. Around 18-20 students of each class are allocated to a mentor who keeps a close rapport with each student with regard to academic and personal matters.Student Chapters of IEEE, CSI and ISTE conduct events round the year, keeping students busy with beyond-the-classroom activities."
      ]
    },
    {
      "tag": "admissions",
      "patterns": [
        "how do i get admission",
        "admission",
        "how to get admitted",
        "admission process"
      ],
      "responses": [
        
        "Admissions to the Institute are made along with the other engineering colleges in the state through a common entrance test conducted by the Govt. of Telangana.Required Documents during reporting for new Admissions 2023-2024 .The Eligibility Criteria For Admission To B.Tech Courses .70 % of the seats are allotted based on the merit in the Engineering and Medical Common Entrance Test (EAMCET) conducted by Govt. of Telengana /Andhra Pradesh.30 % of the seats are earmarked for Management / NRI candidates.In addition to the above, Diploma holders are admitted in second year of B.Tech to the extent of 20% of intake based on the merit in the Engineering Common Entrance Test (ECET), under lateral entry scheme conducted by Govt. of Telengana / Andhra Pradesh.B Category Seats.The Admission pattern to B. Tech is as follows.The minimum qualification for admission to first year B. Tech course is 50% pass in the Intermediate (10 + 2) conducted by the board of Intermediate education, Govt. of Telangana or any other examination recognized as equivalent to Mathematics, Physics and Chemistry as optional subjects."


      ]
    },
    {
      "tag": "cse info",
      "patterns": [
        "cse overview",
        "about cse" 
      ],
      "responses": [
        "The Department of Computer Science and Engineering at MLR Institute of Technology has been offering a Bachelor of Technology (B.Tech) program in Computer Science and Engineering since 2005, with an initial intake of 60 students. Over the years, the program has grown in popularity, and the intake capacity has been increased to 120 students in 2007, 180 in 2012, and 240 in 2013. Recognizing the need for advanced education in the field of computer science and engineering, the department also offers a Master of Technology (M.Tech) program in Computer Science and Engineering since 2011, with an intake of 18 students. In addition to the academic programs, the department has established a dedicated research center to encourage research and development in various areas of computer science and engineering. The research center is equipped with state-of-the-art infrastructure and facilities and provides a platform for faculty members, research scholars, and students to engage in research activities and collaborate with industry experts. The research center focuses on interdisciplinary research, with research areas including artificial intelligence, machine learning, computer networks, cybersecurity, and software engineering, among others. The B.Tech (Computer Science and Engineering) program offered by the department has been accredited by the National Board of Accreditation (NBA) since 2008, which is a testament to the quality of education and infrastructure provided by the department. The department has a team of highly qualified faculty members who are experts in their respective fields and are dedicated to providing quality education to the students. The curriculum of the programs is regularly updated to keep up with the latest developments in the field of computer science and engineering. In addition to the regular intake, the department also offers an additional 10% of seats under the lateral entry scheme, which allows students who have completed a diploma or equivalent course in engineering to join the B.Tech program directly in the second year. The department also encourages students to participate in extracurricular activities, such as coding competitions, hackathons, and seminars, to help them develop practical skills and stay up-to-date with the latest trends in the industry. Overall, the Department of Computer Science and Engineering at MLR Institute of Technology is committed to providing a holistic education to the students, preparing them for successful careers in the field of computer science and engineering, and contributing to the advancement of knowledge through its research center."
      ]
    },
    {
      "tag": "ece info",
      "patterns": [
        "ece overview",
        "about ece" 
      ],
      "responses": [
         "The Electronics and Communication Engineering (ECE) Department was established in the year 2005 with the intake of 60. In the year 2015, the Institution was granted Autonomous Status. Currently the department offers four year B. Tech course with the student intake of 240 and two PG programs: 1) Embedded Systems and 2) Digital Systems and Computer Electronics with the intake of 24 each. The Department had received Accreditation by NBA for 3 years in the year 2013 and again in the year 2016. The department is staffed by highly qualified and well experienced teaching faculty and technical staff. The department is an active member of IETE, ISTE, IEEE and IUCEE. The department has well-equipped laboratories coupled with extensive practical work ensure that the student receives a well-rounded education. The significant equipment in the laboratories supports for carrying out research include PCB Design Machine, Spectrum Analyzer, Digital Storage Oscilloscopes, Spartan 3E (FPGA) kits, TMS 320C6748 DSP kits with Code Composer Studio. The labs are also equipped with Software’s such as MULTISIM, VHDL, Xilinx ISE Foundation, Cadence, and MATLAB with tool boxes. The department has FOUR Centers of excellence, namely: 1) Embedded & Robotics, 2) Cadence, 3) MAT Lab and 4) Lab VIEW Academy. The objective of these Centers of Excellence is to facilitate and promote Research and Development. The department encourages all the students to work on micro projects under COE’s in addition to their mini and major projects and also the department encourages the students to exhibit their projects in various competitions held in various Universities and IIT’s. The students of ECE department have won a number of prizes in various events conducted by IITs and other reputed Institutions. To name a few: 1) 1st prize (Rs.30,000) in RESEARCH EXPO at “SHASTRA-2018, IIT Madras; 2) 1st prize (Rs.30,000) in ANVESHANA-2017, HYDERABAD (5th Edition); 3) 1st prize in “EXHIPRO” conducted by “SPOORTHI 2018, JNTUH, Hyderabad; 4) 1st prize in “E-PAPYRUS” by SPORTHI’18, JNTU-CEH; 5) 1st prize in “HAVANA” National Level Inter-college Technical Championship at GITAM University, Hyderabad. The department has a number of PhD scholars working in various research areas namely: Image and Video Processing, Signal Processing, Embedded Systems, Nano materials, Micro wave Communications and VLSI Technology. Faculty and Students have published over 80 papers on their projects and research work in various Scopus indexed International journals. Further, six research papers were accepted and presented in the World Summit on Science, Engineering and Technology (Cambridge Summit 2018) Conference held during 4th – 6th January 2018 at University of Cambridge, UK. Dr Karthik Rajendra, Professor of ECE, was felicitated in the conference for his contribution as a Session Chair. Dr Arulananth, Professor of ECE, had received Bharat Vikas award from Institute of Self Reliance on 19th Nov’2017, for his Loyalty, Deligence, and outstanding performance in the field of Communication Engineering. The department is running an Innovative Projects cell to nurture creativity and innovation and an Entrepreneurship Development Cell to guide students with an inclination towards starting up their own venture. The department is running gap labs between 4 pm & 6 pm in the evening for students to encourage the research activities."
      ]
    },
    {
    "tag": "it info",
      "patterns": [
        "it overview",
        "about it" 
      ],
      "responses": [
       " The Department of Information Technology was established in the year 2005 with an intake of 60. The department offers Under Graduates (UG) Degree program of 4 years with the current intake of 180. The Department works towards providing excellent learning facilities to produce quality engineers who can meet the National and Global Industry expectations. The Department attributes its success to the creative and innovative outlook of its Students and Faculty. Students are also made to undergo in-house training programs, where they enhance their technical skill in the realm of computers. The Academic emphasis is on all-round Personality Development of the Student combining Theoretical, Application and General Skills. The Curriculum is frequently revised to suit the changing needs of the IT Industry. The Department Faculty are highly qualified and majority of the Faculty members are engaged in R & D activities. A whole range of good career prospects is available for students of the department on successful completion of the course. Many Students hold important positions in well reputed organizations in IT Industry, Government Sector and Banking Sector in India and Abroad. The modern air conditioned laboratories of the department serve the teaching and research needs of the students and faculty. All systems are connected to the department LAN through fiber optic which is a part of the Institute LAN network. Internet connectivity is provided by a 150 Mbps link leased from Gateway and Vainavi. Additional facilities like Central Computing Facility, e-Class room with multimedia facilities, Internet, Centrally air-conditioned Seminar Hall/Auditorium are also available. The department has been striving hard to inculcate conceptual and technical skills in students through a scientific teaching methodology based on lectures, case studies, seminars, group discussions, project works, assignments, quiz programs etc. The systematic and well planned approach to problem solving is emphasized in the classrooms, laboratories through the course projects and additional computer training beyond the scope of the syllabus. Teaching aids such as LCD Projector, OHP, CD demo, equipment demonstrations, Models, Charts etc are regularly used to enhance better understanding. Around 18-20 students of each class are allocated to a teacher who keeps a close rapport with each student with regard to academic and personal matters. Student Chapters of IEEE, CSI and ISTE conduct events round the year, keeping students busy with beyond-the-classroom activities A good number of Students (more than 80%) find placements in the campus interviews by leading companies like EPAM, Cognizant(CTS),mindTree, capgemini, grey campus, Infosys Technologies Limited, Tech Mahindra, NTT Data, Mphasis, Tata Consultancy Services, Cyient, CDK Global, NCR Corporation, Computer Sciences Corporation,Gobal Edge,Immonids and Cyient etc. and lead a successful career. About 10% of the students get admissions in prestigious institutes in India and abroad for higher studies and are performing well there."
      ]
    },
    {
      "tag": "mechanical info",
        "patterns": [
          "mechanical overview",
          "about mechanical mech" 
        ],
        "responses": [
         " Among many engineering disciplines, Mechanical Engineering is the broadest engineering fields with ample application fields. Mechanical Engineering encompasses enormous range of technical areas such as- Refrigeration & Air-conditioning, Control & monitoring mechanisms, Computer-aided Design, Energy Management, Fluid mechanics, Tribology, Robotics, Biomechanics, Turbo- machinery, materials and Nanotechnology, Mechatronics etc. In ever changing scenario of present day technology, Mechanical Engineering is a challenging, rewarding, and highly respected profession. The department of Mechanical Engineering was established in the year 2009 with an initial intake of 60 students. The department is also offering M.Tech program in Thermal Engineering with an annual intake of 18 students. The B.Tech (Mechanical Engineering) Program has been accredited by the National Board of Accreditation (NBA) since 2016 for 3 years and in 2019, got NBA TIER-I accreditation for 3 years. The Department of Mechanical Engineering has 30 well experienced and qualified faculty members supported by 6 technical staff. Department could prove the consultancy abilities through design and fabrication works of sports and structural equipment in recent past to badminton academy, Hyderabad. The department is headed by Prof. M. Venkateswar Reddy having vast industrial and teaching experience. The department currently has 8 Ph.Ds having research/ academic/ consultancy/ industrial experience. Faculty research experience covers a wide range of core and extended fields like Alternate fuels and IC engines, Composites and Biomedical applications, Manufacturing & Welding Technology, Robotics and CAD/CAM. Mechanical Engineering Department has a state- of- art Centres of Excellence in Product Life Cycle Management (PLM) by TATA Technologies, Digital Manufacturing, Advanced Composite Materials, and Computational Engineering by Dassault Systems. The department has well equipped laboratories with research facilities viz., ACE Micromatic, 6- Station Vertical Machining Centre, a CNC turning centre and 3D printing technology with supporting CAD/CAM laboratory and latest softwares for modeling and analysis such as ANSYS, CATIA, CREO, ROKISIM, PTC WINDCHILL, AUTOCAD, CADEM, STABULI, MATLAB and ENOVIA in which the students are encouraged to do in-house research projects. Mechanical Engineering deals with the formulation, design, development and control systems and components involving solid mechanics, dynamics and controls, fluid mechanics, heat and mass transfer, manufacturing and conversion of energy into useful work. Industries that use mechanical engineers involved in Robotics, Computer Aided Design/Manufacturing (CAD/CAM), Automotive/Transportation, Air- Conditioning and Refrigeration. Senior faculty members of this department have been chosen from various parts of India comprising vast Industrial and research experience. Students of the department have been placed in various companies like Infosys; TATA Steel; TASL; LTI; Hexaware; Grey Campus; CTC; KIA R&D (HYUNDAI); MG; KPIT Cummins; Shakti Hormann; Raam Group; Accenture; Cognizant; HCL Technologies; People Link; MEIL; RDC Concrete; Maker Global; Multiplier Solutions; BYJU’s; Cyient; Tech Mahindra; Hyundai Transys; TAFE; Medha Servo Systems; Wipro; TCS; Sterling & Wilson; Capgemini; Rane Engineering; Vem Technologies; Deepak Nitrite; IBS Software; NTT Data; Rapid Robotics. A significant number of graduating engineers are pursuing their higher studies in various universities abroad by securing higher qualifying grades in GRE/TOEFL/IELTS etc."
        ]
      },
      {
      "tag": "csit info",
        "patterns": [
          "csit overview",
          "about csit" 
        ],
        "responses": [
           "MLR Institute of Technology takes the pride of introducing the Computer Science and Information Technology program – a blend of Computer Science and Information Technology at its best, with intake of 60 from academic year 2020-2021. This course gives the best of both Computer Science and Information Technology courses as a single course. This course covers everything that is needed to dive into any area across the entire IT industry landscape. Computer Science and Information Technology graduates will enjoy the privilege and command much higher salaries compared to other graduates of similar courses. They can grab more opportunities than Computer Science and Engineering and Information Technology graduates. MLR Institute of Technology has state of the art infrastructure compared to any other college in Telangana region. MLR Institute of Technology has proven track record in terms of experienced, well qualified and industry trained staff. Computer Science and Information Technology staff has the passion and commitment to nurture the skills of young budding engineer to precisely fit into the contemporary IT landscape. The Department is well equipped with the state of the art infrastructure not just limited to classrooms, seminar halls, laboratories but to the extent of advanced computing facility through real time cluster and production environments in place." 
       ]
      },
      {
        "tag": "eee info",
          "patterns": [
            "eee overview",
            "about eee" 
          ],
          "responses": [
           "Electrical and Electronics Engineering (EEE) is a field of engineering that generally deals with the study and application of electricity, electronics, and electromagnetism.The EEE department is established with state of art technical facilities to impart knowledge required for future educational and industrial needs. It has acoustic proof class rooms with audio-visual teaching aids. The departmental laboratories are furnished with latest equipment and instruments along with internet and computer systems. The department has well experienced faculties from reputed industries and institutions. It has well defined syllabus suited for needs of academic, industrial and research across the globe. The department is well integrated by standalone seminar hall and supporting auditorium to conduct seminars, workshops and training programs. The goal of the department is to create engineers of high technical skills in the Electrical and Electronics Engineering field suitable for employment in reputed firms and for higher studies. The department caters to the ever increasing needs of technical brilliance in all areas of Electrical and Electronics Engineering such as integrated Electronics and Circuits, Control & Automation, Electrical Machines, Power Electronics and Power systems. The students are provided opportunities to develop their professionalism, life-long learning skill, and team-work and communication skills through their compulsory participation on a yearlong academic project. Students are encouraged to come up with their own ideas and those ideas are materialised by the department into actual projects with societal impact. The students are also encouraged to publish their work based on the projects undertaken. The department also focuses on overall development of the student’s soft skills through projects and seminar presentations, Student’s Association activities and industrial visits. Holistic education and professional ethics are integral part of the curriculum."
          ]
        },
        {
          "tag": "csd info",
            "patterns": [
              "csd overview",
              "about csd" 
            ],
            "responses": [
               "Data analysis and prediction rely increasingly on Data science, and the speed with which computing technology continues to transform our daily lives is truly astonishing. Specialists in this subject area are in demand all over the world because their applied skills can revolutionize businesses and organizations of all kinds. The fast changing technological scenario poses to the Institute a challenge of continuously updating its curriculum and faculty to be able to provide state-of-the-art education to the students. Changes, both major and subtle, have been made by the department of Data Science (CSD), to be better prepared for tomorrow. The B.Tech program in Data Science was started in the year 2020 with an intake of 60, increased to 60 in 2021. The department is headed by Dr.P Madhuravani, with vast Industrial and Teaching experience of 15 years. The department currently has 56 faculty members, including 9 doctorates. Faculty research interest spans a wide range: from abstract theory to down-to-earth problems of immediate interest to industry. Current areas of research of the department has broadly classified into the following categories: Multiple, Heterogeneous Data Sources, Precious Data, Inferring From Noisy and/or Incomplete Data, Computing Systems for Data-Intensive Applications, Automating Front-End Stages of the Data Life Cycle. The department is actively involved in R & D as well as consultancy projects and has collaborations with several industries, academic institutes and R & D organizations in the country. The modern air conditioned laboratories of the department serve the teaching and research needs of the students and faculty. All systems are connected to the department LAN through fiber optic which is a part of the Institute LAN network. Internet connectivity is provided by a 300 Mbps link leased from Gateway and Vainavi. Additional facilities like Central Computing Facility, e-Class room with multimedia facilities, Internet, Centrally air-conditioned Seminar Hall/Auditorium are also available. The department has been striving hard to inculcate conceptual and technical skills in students through a scientific teaching methodology based on lectures, case studies, seminars, group discussions, project works, assignments, quiz programs etc. The systematic and well planned approach to problem solving is emphasized in the classrooms, laboratories through the course projects and additional computer training beyond the scope of the syllabus. Teaching aids such as LCD Projector, OHP, CD demo, equipment demonstrations, Models, Charts etc are regularly used to enhance better understanding. Around 18-20 students of each class are allocated to a mentor who keeps a close rapport with each student with regard to academic and personal matters. Student Chapters of IEEE, CSI and ISTE conduct events round the year, keeping students busy with beyond-the-classroom activities."
            ]
          },
          {
            "tag": "csc info",
              "patterns": [
                "csc overview",
                "about csc" 
              ],
              "responses": [
                "Security rely increasingly on Cyber security, and the speed with which computing technology continues to transform our daily lives is truly astonishing. Specialists in this subject area are in demand all over the world because their applied skills can revolutionize businesses and organizations of all kinds. The fast changing technological scenario poses to the Institute a challenge of continuously updating its curriculum and faculty to be able to provide state-of-the-art education to the students. Changes, both major and subtle, have been made by the department of Cyber security (CSC), to be better prepared for tomorrow. The B.Tech program in Cyber Security was started in the year 2020 with an intake of 60, increased to 120 in 2021. The department is headed by Dr.P Madhuravani, with vast Industrial and Teaching experience of 15 years. The department currently has 56 faculty members, including 9 doctorates. Faculty research interest spans a wide range: from abstract theory to down-to-earth problems of immediate interest to industry. Current areas of research of the department has broadly classified into the following categories: Computer Network Security, Application Security, Web Services Security, Mobile Security, Protective Security, Software Security, Wireless & Sensor Network Security, Software Coding Security. The department is actively involved in R & D as well as consultancy projects and has collaborations with several industries, academic institutes and R & D organizations in the country. The modern air conditioned laboratories of the department serve the teaching and research needs of the students and faculty. All systems are connected to the department LAN through fiber optic which is a part of the Institute LAN network. Internet connectivity is provided by a 300 Mbps link leased from Gateway and Vainavi. Additional facilities like Central Computing Facility, e-Class room with multimedia facilities, Internet, Centrally air-conditioned Seminar Hall/Auditorium are also available. The department has been striving hard to inculcate conceptual and technical skills in students through a scientific teaching methodology based on lectures, case studies, seminars, group discussions, project works, assignments, quiz programs etc. The systematic and well planned approach to problem solving is emphasized in the classrooms, laboratories through the course projects and additional computer training beyond the scope of the syllabus. Teaching aids such as LCD Projector, OHP, CD demo, equipment demonstrations, Models, Charts etc are regularly used to enhance better understanding. Around 18-20 students of each class are allocated to a mentor who keeps a close rapport with each student with regard to academic and personal matters. Student Chapters of IEEE, CSI and ISTE conduct events round the year, keeping students busy with beyond-the-classroom activities. "
              ]
            },
            {
              "tag": "aero info",
                "patterns": [
                  "aero overview",
                  "about aero" 
                ],
                "responses": [
                 "The department of aeronautical engineering at MLRIT with excellent infrastructure and state-of-the art laboratories provides an ideal ambience for its graduate for research and innovation in one of the most fascinating & challenging branch of engineering. The dedicated faculty and passionate students share the vision of linking the fastest growing aerospace sector towards economic growth of our nation."
                ]
              },
              {
                "tag": "aero faculty",
                  "patterns": [
                    "aero faculty",
                    "aeronautical faculty" 
                  ],
                  "responses": [
                    " Dr. M.Satyanarayana Gupta -HOD & Professor,Dr. A VIVEK ANAND-Professor & Associate Dean, Dr Rakesh Kumar Sharma -Professor,K Veeranjaneyulu - Professor, NAYANI UDAY RANJAN GOUD - Dr. SWETHA BALA MNVS - Associate Professor & Associate Dean, Dr Saiprakash - Associate Professor, BHUPAL RAKHAM - Associate Professor, M. Ganesh - Associate Professor, ALEKHYA BOJJA - ASSISTANT PROFESSOR, MUNIGALA SRIKANTH - Assistant professor, Sreekanth Sura - Assistant professor, Ms.Sravanthi - Assistant professor, Dr. SHRAVAN KOUNDINYA VUTUKURU - Assistant professor, Mr.B.Manideep - Assistant professor, Nirmith Kumar Mishra - Assistant professor, S.Alka - Assistant professor, A Udaya Deepika - Assistant professor, MAHESH KUMAR - Assistant professor, K.ARUNKUMAR - Assistant professor, B. Nagaraj Goud - Assistant professor, K. Shiva Shankar - Assistant professor, A.Saikumar - Assistant professor "
                  ]
                },
                {
                  "tag": "csd faculty",
                    "patterns": [
                      "csd faculty",
                      "csd datascience faculty" 
                    ],
                    "responses": [
                        "PENUBAKA KIRAN KUMAR REDDY - Professor, Dr.M DILEEP KUMAR - Professor, KAMBHAM PRATAP JOSHI - Associate Professor, Rowsonara Begum - Assistant Professor, Ms. Salini Roy Chowdhury - Assistant Professor, G Swapna - Assistant Professor, Roger Jees Smith T - Assistant Professor. "
                    ]
                  },
                  {
                    "tag": "cse faculty",
                      "patterns": [
                        "cse faculty",
                        "cse datascience faculty" 
                      ],
                      "responses": [
                      "Dr.K.Srinivas Rao - Professor, Dr A BALARAM - Professor & Head, Dr.N SIRISHA - Professor & Associate Dean, Mr. Sai Krishna - Associate Professor, Mr. Nagarjuna Thandra - Associate Professor, Dr. B SANJAI PRASADA RAO - Associate Professor, Dr.P.Michael Preetam Raj - Associate Professor, Dr. M. KalpanaChowdary - Associate Professor, ANANDKUMAR B - Associate Professor, Mr. BOLLEDDU DEVANANDA RAO - Associate Professor, Mrs. K.Pushpa Rani - Associate Professor, G PRABHAKARA REDDY - Associate Professor, Mrs. N THULASI CHITRA - Associate Professor, Mr. M SRINIVASA RAO - Associate Professor, Dr.P.Chinnasamy - Associate Professor."
                      ]
                    },
                    {
                      "tag": "ece faculty",
                        "patterns": [
                          "ece faculty",
                          "ece course faculty" 
                        ],
                        "responses": [
                          "Dr. S V S Prasad - Professor and Head, Dr. T. S. Arulananth - Professor, Dr. B. SRIDHAR - Professor, Mr. Ashok Kumar Cheeli - Professor, Mr. P Yakaiah - Professor, Mr. ROLLAKANTI RAJU - Associate Professor, Dr. Kiran Dasari - Associate Professor, Dr. K Phaneendra - Associate Professor, Dr. G. Karthik Reddy - Associate Professor, Dr. Rajan Singh - Associate Professor, Mrs. T. Vijetha - Associate Professor, Mr. RAMESH PEDDAVENI - Associate Professor, Mr. V Syambabu - Associate Professor, Mr. K HARI BABU - Associate Professor, Dr. K NISHANTH RAO - Associate Professor, Mr. GOLI NAGESH - Assistant Professor, Dr. Kiran Chand Ravi - Assistant Professor, Mrs. Pinnamaraju Sahitya - Assistant Professor, Mr. Ladi sandip kumar patra - Assistant Professor, Mr. VADLA ARUN KUMAR - Assistant Professor, Mrs. PEDDI SWETHA - Assistant Professor, Mr. S Rahul - Assistant Professor, Dr. Manoj Kumar - Assistant Professor, Ms. Badepalli Sireesha - Assistant Professor, Mrs. N Poornima Deepthi - Assistant Professor, Dr. Bittu Kumar - Assistant Professor, Mr. B. KIRAN KUMAR - Assistant Professor, Mr. G V S Manoj Kumar - Assistant Professor, Dr. Pulkit Singh - Assistant Professor, Ms. Anitha - Assistant Professor, Mrs. Sailaja Mummala - Assistant Professor, Mrs. K HARIKA - Assistant professor, Mr. G Kaushik - Assistant professor, Mrs. Geetha Yerramsetti - Assistant professor, Mr. M. RAJU NAIK - Assistant professor, Mr. K. Maniraj - Assistant Professor, Mr. Sudhakar Ajmera - Assistant professor, Ms. BADEPALLI ANUSHA - Assistant professor, Mr. CHINTHAKINDI BABAIAH - Assistant professor, Mr. K. Naveen - Assistant professor, Mr. RAYALA SATEESH - Assistant professor, Mrs. S. Monika - Assistant professor, P B NATARAJAN - Assistant professor. "
 
                         ]
                      },
                      {
                        "tag": "it faculty",
                          "patterns": [
                            "it faculty",
                            "it course faculty" 
                          ],
                          "responses": [
                              "Dr. N. V RajaSekhar Reddy - Professor & HOD, Dr T V Nagaraju - Associate Professor, Sk.Khaja Shareef - Associate Professor, Amarendra Reddy Panyala - Assistant professor, VEMURI NITIN - Assistant professor, J PRADEEP KUMAR - Assistant professor, B. Veerasekhar reddy - Assistant professor, Mrs SHRUTI PATIL - Assistant professor, I.V.S HARITHA - Assistant professor, D. Sandeep - Assistant professor, J Adilakshmi - Lab Asst., R Srikanth - Assistant professor, Mrs Jeethu Philip - Assistant professor, Bhasker Boddu - Assistant professor, P laxmaiah - Assistant professor, B Varija - Assistant professor, B Sushma - Assistant professor, G Sathyanarayan - Assistant professor, Mohd Anwar Ali - Assistant professor, E GURUMOHAN RAO - Assistant professor, D Nilima - Assistant professor, M Srividya - Assistant professor, Ch Lakshmi deepika - Assistant professor, A Kiran Kumar Reddy - Assistant professor. "   
                           ]
                        },
                        {
                          "tag": "mechanical faculty",
                            "patterns": [
                              "mechanical faculty",
                              "mech faculty" 
                            ],
                            "responses": [
                              "Dr. Lokasani Bhanuprakash - Professor, Dr. J. Krishnaraj - Professor, Dr. MUHAMMED ANAZ KHAN - HOD, Mr. S. NAGARAJU - Associate Professor, Dr. P. Bridjesh - Associate Professor, Dr. N Prabhu Kishore - Associate Professor, Dr. Pramod Kumar Peyyala - Associate Professor, Dr. G. Anandarao - Associate Professor, Mr.Venkata Phani Babu Vemuri - Associate Professor, Dr. GOTTIPATI VENKATA RAMBABU - Associate Professor, Mrs. K. Vasundhara - Associate Professor, Prof. M. Venkateswar Reddy - Associate Professor, Mr. CHINTALA MURALIKRISHNA - Assistant Professor, Dr. HARIKISHOR KUMAR - Assistant professor, Mr.J.Sunil Kumar - Assistant professor, Dr. J Laxmi Prasad - Assistant professor, Mr. N E Chandra Prasad - Assistant Professor, Mr. Mudhuganti Mahender - Assistant professor, Dr. G. Chandramohan Reddy - Assistant professor, Dr. Ch. Ravi Kiran - Assistant professor, Mr. M. Sundeep - Assistant professor, Dr. K. Limbadri - Assistant professor. "
                            ]
                          },
                          {
                            "tag": "csit faculty",
                              "patterns": [
                                "csit faculty",
                                "csit course faculty" 
                              ],
                              "responses": [
                                "Dr. P. Subhashini - Professor & Associate Dean, Gunda Aishwarya - Associate Professor, T mounika - Associate Professor, K Samunnisa - Associate Professor, Sk.Kalam Basha - Associate Professor, A Sangeetha - Associate Professor, V. Srikanth - Assistant Professor, T. Gandhi - Assistant Professor, Mrs T. Mounika - Assistant Professor, S. Spandana - Assistant Professor, Mrs S.Parvathi - Assistant Professor, Mrs N. Sandhya Rani - Assistant Professor, Mrs M.Srividya - Assistant Professor, Mrs G.Lavanya - Assistant Professor, Mrs D.Rajeswari - Assistant Professor, Mrs D.Neelima - Assistant Professor, Mrs Ch.Vijayasri - Assistant Professor, Mrs. A.Nirisha - Assistant Professor."

                              ]
                            },
                            {
                              "tag": "eee faculty",
                                "patterns": [
                                  "eee faculty",
                                  "eee course faculty" 
                                ],
                                "responses": [
                                  "Dr. A Sudhakar - HOD, Dr. B. V. Rajanna - Associate Professor, Dr.M.DILIP KUMAR - Associate Professor, Dr. M SREENIVASA REDDY - Associate Professor, T MRUDULA - Assistant Professor, N KARTHIK - Assistant professor, T Bhargava Ramu - Assistant professor, p jithendar - Assistant professor, A Yadagiri - Assistant professor, K. RAJASRI - Assistant professor, A Shubhangi Rao - Assistant professor, Dr. CH SRIVARDHAN KUMAR - Assistant professor."
                                ]
                              },
                              {
                                "tag": "scholarship",
                                "patterns": [
                                  "scholarship",
                                  "do college have scholarshp?"
                                ],
                                "responses": [
                                  "college do have scholarship facility which is given by the state government based on merit"
                                
                                ]
                              }
  ]
}
